Autodesk.Revit.DB.FabricationVersionInfo.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.FabricationVersionInfo.Reason
The user-specified reason for the change.
Since:
2019

Autodesk.Revit.DB.FabricationVersionInfo.Version
The version number of the change.
Since:
2019

Autodesk.Revit.DB.FabricationVersionInfo
The object contains versioning information about fabrication data.
Since:
2019